# Pandas Pivot Table

### **Aug 28, 2025 at 2:42 PM**

### **Python | Pandas.pivot()**
pandas.pivot(index, columns, values) function produces a pivot table based on 3 columns of the DataFrame. Uses unique values from the index/columns and fills them with values.

<div class="alert alert-block alert-success">
<b>Syntax:</b> pandas.pivot(index, columns, values)

<b>Parameters:</b> 
<ol>
    <li><b>index[ndarray] :</b> Labels to use to make new frame’s index</li>
    <li><b>columns[ndarray] :</b> Labels to use to make new frame’s columns</li>
    <li><b>values[ndarray] :</b> Values to use for populating new frame’s values</li>
</ol>

<b>Returns:</b> Reshaped DataFrame

<b>Exception:</b> ValueError raised if there are any duplicates.
</div>

### **Creating a Sample DataFrame**

In [4]:
# Here, we are making a sample DataFrame that we will use in our article throughout.
import pandas as pd

# creating dataframe
df = pd.DataFrame({"A": ["John", "Body", "Mina"],
                   "B": ["Master", "Graduate", "Graduate"],
                   "C": [27, 23, 21]})
df

      A         B   C
0  John    Master  27
1  Body  Graduate  23
2  Mina  Graduate  21

### **Creating and Pivot a DataFrame**
In this example, a pandas DataFrame (df) is pivoted with columns ‘A’ and ‘B’ becoming the new index and columns, respectively, and the values in column ‘C’ populating the cells of the resulting pivot table. The function assumes that each combination of ‘A’ and ‘B’ has a unique corresponding value in ‘C’.

In [11]:
# values can be an object or a list 
results = df.pivot(index='A', columns='B', values='C')
results

B     Graduate  Master
A
Body      23.0     NaN
John       NaN    27.0
Mina      21.0     NaN

### **Creating a Multi-level Pivot Table with Pandas DataFrame**

In this example, the pandas DataFrame (df) is transformed into a multi-level pivot table, using ‘A’ as the index, ‘B’ as the columns, and extracting values from both columns ‘C’ and ‘A’ to fill the cells. This approach allows for a more detailed representation of the data, incorporating multiple dimensions into the resulting pivot table.

In [12]:
df.pivot(index="A", columns="B", values=["C", "A"])

            C               A
B    Graduate Master Graduate Master
A
Body       23    NaN     Body    NaN
John      NaN     27      NaN   John
Mina       21    NaN     Mina    NaN

### **ValueError Raised in Pivoting a DataFrame**
Raise ValueError when there are any index, columns combinations with multiple values.

In [ ]:
# importing pandas as pd
import pandas as pd

# creating a dataframe
df = pd.DataFrame({"A": ["John", "John", "Mina"],
                   "B": ["Masters", "Masters", "Graduate"],
                   "C": [27, 23, 21]})

df.pivot(index="A", columns="B", values="C")

<div class="alert alert-block alert-danger">
<b>ValueError:</b> Index contains duplicate entries, cannot reshape
</div>

### **Pandas.pivot_table() – Python**
Last Updated : 28 Apr, 2025

pandas.pivot_table() function allows us to create a pivot table to summarize and aggregate data. This function is important when working with large datasets to analyze and transform data efficiently. In this article, we will see some examples to see how it works.

In [14]:
# Let's see an example
import pandas as pd
df = pd.DataFrame({
    'A': ['John', 'Boby', 'Mina', 'Peter', 'Nicky'],
    'B': ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'],
    'C': [27, 23, 21, 23, 24]
})

df
table = pd.pivot_table(df, index=['A', 'B'])
table

                   C
A     B
Boby  Graduate  23.0
John  Masters   27.0
Mina  Graduate  21.0
Nicky Graduate  24.0
Peter Masters   23.0

Here pd.pivot_table(df, index=[‘A’, ‘B’]) created a pivot table that groups data by columns ‘A’ and ‘B’ and aggregates their values by calculating their mean.
<div class="alert alert-block alert-success">
<b>Syntax:</b> DataFrame.pivot_table(values=None, index=None, columns=None, aggfunc=’mean’, fill_value=None, margins=False, dropna=True)
</div>

Parameters:
<ul>
<li>values: Columns to aggregate.</li>
    <li>index: Columns to use as the new row index.</li>
    <li>columns: Columns to use as the new column headers.</li>
    <li>aggfunc: Aggregation functions like mean, sum, count etc. By default it is mean.</li>
    <li>fill_value: Value to replace missing data.</li>
    <li>margins: Whether to add totals, default is false.</li>
    <li>dropna: Whether to exclude missing values from the DataFrame, default is True.</li>
</ul>

Returns: DataFrame

### **Example 1: Using the values and aggfunc Parameters**
We can customize aggregation by specifying the values parameter (column to aggregate) and the aggfunc parameter (aggregation function). By default aggregation is mean but we can use functions like sum, count etc.
<ul>
<li><b>table = pd.pivot_table(df, values=’C’, index=’C’, columns=’B’, aggfunc=’sum’):</b> Creating a pivot table that groups data by column ‘C’ as rows and column ‘B’ as columns which helps in summing values in column ‘C’ for each combination of ‘C’ and ‘B’.</li>
</ul>

In [16]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "A": ['John', 'Boby', 'Mina', 'Peter', 'Nicky'],
    'B': ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'],
    'C': [27, 23, 21, 23, 24]
})

table = pd.pivot_table(df, values="C", index="C", columns="B", aggfunc="sum")
table

B  Graduate Masters
C
21     Mina     NaN
23     Boby   Peter
24    Nicky     NaN
27      NaN    John

### **Example 2: Handling Missing Data with fill_value**
Using the fill_value parameter to replace missing values in the pivot table. This is helpful when we don’t want missing data to appear as NaN.
<ul>
<li><b>table = pd.pivot_table(df, values=’C’, index=[‘A’, ‘B’], fill_value=0):</b> Creating a pivot table that groups data by columns ‘A’ and ‘B’ and helps in aggregating values in column ‘C’ and it replaces any missing values with 0.</li>
</ul>

In [19]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    "A": ["John", "Body", "Mina", "Peter", "Nicky"],
    "B": ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'],
    'C': [27, 23, 21, 23, 0]
})

table = pd.pivot_table(df, values="C", index=["A", "B"], fill_value=0)
table

                   C
A     B
Body  Graduate  23.0
John  Masters   27.0
Mina  Graduate  21.0
Nicky Graduate   0.0
Peter Masters   23.0

### **Example 3: Adding Totals with margins**
The marginsparameter adds total rows and columns to the pivot table. This is useful when we want to see overall totals for each row or column.
<ul>
<li><b>table = pd.pivot_table(df, values=’C’, index=[‘A’, ‘B’], aggfunc=’mean’, margins=True):</b> Creating a pivot table that groups data by columns ‘A’ and ‘B’ and helps in calculating mean of values in column ‘C’ and adds a total row and column with the overall mean (using margins=True).
</ul>

In [20]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A': ['John', 'Boby', 'Mina', 'Peter', 'Nicky'],
    'B': ['Masters', 'Graduate', 'Graduate', 'Masters', 'Graduate'],
    'C': [27, 23, 21, 23, 24]
})

table = pd.pivot_table(df, values="C", index=["A", "B"], aggfunc="mean", margins=True)
table

                   C
A     B
Boby  Graduate  23.0
John  Masters   27.0
Mina  Graduate  21.0
Nicky Graduate  24.0
Peter Masters   23.0
All             23.6

With pandas.pivot_table() we can create customizable summaries of our data which is required for specific analysis needs.